% Переменные подводного аппарата

m = 24.7; %24.7
% ???
Cx = 52.92;
lambda11 = 0.6;

% Коэффициенты, которые необходимо синтезировать
k1_m = 5.09199;
k2_m = 2.19;

Jyy = 0.78;
Cwy1 = 0.0074;
Cwy2 = 0.0527;
lambda55 = 0.9;

% Коэффициенты, которые необходимо синтезировать
%k1_k = 1;
k1_k = 0.3;
k2_k = 0.16732;

K_thruster = 2.89;
T_thruster = 0.1;

l = 0.1167;

% коэффициент перевода из радиан в градусы
kc = 57.2958;

% Ширина галса в метрах
L = 1.760;

% Радиус точки траектории
Rmin = 0.4;

%Течение направлено вдоль оси Z
Vz = 0;
%Vz = 0.1;
%Vz = 0.2;

%коэффициент ошибки
k_gamma = 4;

% угол упреждения в градусах: 10 7 и 8.5; 

%deflection = 7;
%deflection = 8.5;
%deflection = 10;
%deflection = 17;
deflection = 0;