% *************************************************
% *** Переменные подводного аппарата
% *************************************************

m = 300; % кг
Cvx1 = 182.87;
Cvx2 = 33;
lambda11 = 12.72;

Jyy = 366;
Cwy1 = 1144.7;
Cwy2 = 22.52;
lambda55 = 117.08;

P1 = 60 * 9.81; % = 588 H, упор одного движителя
U1 = 24; % В, напряжение

K_thruster = P1 / U1; % = 24.5 H/B;
T_thruster = 0.3; % с

l = 0.225;

% Коэффициенты, которые необходимо синтезировать
k1_m = 600; %4066;
k2_m = 500; %527.58;



% Коэффициенты, которые необходимо синтезировать
%k1_k = 1;
k1_k = 0.3;
k2_k = 0.16732;



% коэффициент перевода из радиан в градусы
kc = 57.2958;

